### Списки:
# 1. **Робота із списками:**
#    Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.
# 2. **Знаходження суми:**
#    Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.
# 3. **Подвійні значення:**
#    Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.
### Кортежі:
# 1. **Робота із кортежами:**
#    Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.
# 2. **Об'єднання кортежів:**
#    Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.
### Словники:
# 1. **Робота із словниками:**
#    Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.
# 2. **Оновлення словника:**
#    Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.
# 3. **Пошук значення:**
#    Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).
# Завершіть кожне завдання, використовуючи вбудовані методи для списків, кортежів та словників. Бажаю успіхів у виконанні цих завдань!
import random

# 1. **Робота із списками:**
list1 = []
for _ in range(random.randint(4, 6)):
    list1.append(random.randint(1, 50))
list1.insert(random.randint(0, len(list1)), 10)
list1.insert(random.randint(0, len(list1)), 20)

print(f"\n1 Завдання | Списки\n\n-> Згенерований список чисел: {list1}")

list1.remove(10)

print(f"\n-> Отриманий список: {list1}")

# 2. **Знаходження суми:**
sum_list1 = sum(list1)

print(f"\n2 Завдання | Списки\n\n-> Сума чисел списку: {sum_list1}")

# 3. **Подвійні значення:**
list1_double = []
for i in list1:
    list1_double.append(i * 2)

print(f"\n3 Завдання | Списки\n\n-> Подвоєні числа списку: {list1_double}")

# ======================================================================================================================
print("\n","=" * 100)

# 1. **Робота із кортежами:**
tuple1 = ("яблуко", "банан", "апельсин")

print(f"\n1 Завдання | Кортежі\n\n-> Елементи кортежу: {tuple1}")

for item in tuple1:
    print(f"-> {item}")

# 2. **Об'єднання кортежів:**
tuple2 = (1, 2, 3)
tuple3 = (4, 5, 6)
combined_tuple = tuple2 + tuple3

print(f"\n2 Завдання | Кортежі\n\n-> Об'єднаний кортеж: {combined_tuple}")

# ======================================================================================================================
print("\n","=" * 100)

# 1. **Робота із словниками:**
favorite_athlete = {
    "Ім'я": "Місакі Мацумото",
    "Вік": 33,
    "Спорт": "Бадмінтон",
    "Зріст": "159 см",
    "Вага": "50 кг",
    "Народження": "пр.Токушіма, к.Японія"
}

print(f"\n1 Завдання | Словники\n\n-> Інформація про улюбленого спортсмена:")
for key, value in favorite_athlete.items():
    print(f"-> {key} - '{value}'")

# 2. **Оновлення словника:**
favorite_books = {
    "Дюна": 1965,
    "Соляріс": 1961
}

favorite_books["Чи мріють андроїди про електричних овець?"] = 1968

print(f"\n2 Завдання | Словники\n\n-> Оновлений словник улюблених книг:")
for book, year in favorite_books.items():
    print(f"-> '{book}' - {year}")

# 3. **Пошук значення:**
countries_and_capitals = {
    "Україна": "Київ",
    "Франція": "Париж",
    "Німеччина": "Берлін"
}

country = input("\n3 Завдання | Словники\n\n-> Введіть назву країни: ").capitalize()

print(f"-> Столиця: {countries_and_capitals.get(country, 'Такої країни немає у словнику')}")

print()
